//
//  SingleWord.h
//  普通话高频词句
//
//  Created by xieweizhi on 12/18/13.
//  Copyright (c) 2013 xieweizhi. All rights reserved.
//

#ifndef ________SingleWord_h
#define ________SingleWord_h



#endif




#define kAllYears [[NSArray alloc ]initWithObjects:@2013,@2012,@2011,@2010,@2009, nil] ;


/*
 
 single word
 */
#define kSingleWordString2013  @"背 群 丢 女 挺 捐 雄 晕 闯 拽 夸 枪 却 醋 晌 遭 嘎 稚    邢 逆 帘 航 灰 实 标 聘 而 妇 沫 绿 涌 邹 暗 踹 人 贼    雌 鹅 摊 沓 槛 犁 球 酿 信 书 天 哼 杂 灭 替 抓 猿 寡    筒 昏 翁 荒 绝 润 隋 坐 篡 趁 钩 诱 逮 饶 散 栋 发 惹    开 夹 凋 赛 煤 污 爱 关 尊 选 捶 说 卸 坡 往 剖 尿 俩 铡 白 杀 鹤 痣 舌 逮 若 池 筛 得 字 给 二 鳃 棉 宰 拣 凹 淋 槽 品 朝 腔 挠 巷 泡 柄 藕 另 邹 氢 轴 腹 岸 努 榄 筑 瘫 哭 判 粗 忍 藏 午 缸 震 纺 挂 忙 耍 憎 祸 乘 索 正 踹 缝 坏 梦 隋 戏 褪 溺 霞 款 颊 环 掖 蒜 谢 弯 爹 舜 飘 损 表 闯 修 撞 玖 童 约 胸 劝 孔 徐 绒 俊 翁 略 宋 群 掘 总 荀 穷 旅 婶 卷 偶 铡 红 我 姨 秋 次 剜 逮 平 翁 挠 氧 食 判 镖 佣 涩 糖 野 敏 痣 丢 遍 捐 而 仍 接 水 日 音 劣 奖 花 邹 源 兄 咱 润 发 旬 线 扯 拐 虐 品 爱 尚 约 劝 梦 留 共 撕 否 案 框 旅 搓 瘫 踹 蛙 踩 纫 怀 襄 瓜 俩 主 撒 鸣 准 击 穿 嘣 迟 肥 均 窜 混 销 偏 苔 醉 你 擂 阔 缺 克 胞 裆 女 苏 子 氢 申 门 光 掐 度 捐 缴 琴 揣 哪 稻 增 怀 阔 甲 江 留 壮 训 湾 疼 花 嫩 舜 光 藏 杯 星 水 特 惊 首 绿 铅 立 串 捏 入 表 色 乡 唤 扫 铐 锌 铁 日 取 浓 军 笨 三 面 瞎 阅 孩 勇 绝 梦 放 冰 孔 腮 浙 温 求 槛 牛 恰 擦 法 毒 锐 专 耍 飘 外 某 腔 子 旋 枯 始   润 许 雄 脏 赔 队 啄 群 地 边 弹 窗 穷 费 村 否 拼 揭 略 刮 共 怪"

#define kSingleWordString2012  @"胞 浊 沓 揣 蚌 逮 鹤 槛 碑 邹 铐 纽 偶 勺 潘 俏 纫 涩   晌 拈 克 虐 瞟 秦 润 挠 嘭 旅 捐 旋 优 捅 钠 权 训 忆   翁 致 尼 沉 双 广 抡 命 豁 聂 兄 子 乘 脆 目 拨 群 艘   罪 买 红 防 须 亮 决 颇 穷 挖 地 俩 铁 岸 临 丢 馆 扔   灭 军 略 女 扶 团 将 刷 病 洒 未 天 二 层 吃 取 专 迎   划 加 肥 引 却 无 句 给 辞 外 掠 汪 购 您 莫 磁 旗 禹 聊 趋 略 宠 侧 乖 运 食 放 耍 苗 次 略 勤 凳 锅 溶 灭 抠 陇 防 摧 梦 雄 湿 邓 歌 瓦 国 堆 染 月 末 穷 撅 润 广 疗 壮 水 二 值 眸 封 榜 坤 逃 恐 蔫 闯 焦 我 谋 蹿去 花 寻  缺 傻 宾 握 闽 安 溺 盒  傻 质  爽 貂  闻 胸  本  侵  腻 原 啮 徒 猫 肺 松 导 廓 骚 鸟 盅 柳 瑟 旗 禹 聊 趋 辨 品 聂 捐 醉 绒 案 颌 税 领 掉 吹 脓 杯 傍 奶 篮 改 弥 枪 簧 梭 暖 艘 斜 府 菊 训 踱 仓 屡 您 鸥 溺 儿 垦 胸 弱 巢 锅 芽 呆 庞 腔 吮 儒 腻 原 啮 徒 猫 肺 培 摄 牙 旷 北 潜 略 庄 壤 科 贫 均 捆 竿 梅 酥 膜 吃 破贤 耍  瓶 撬 流 蛙 粮 搔 您 子 围 女 破 寡 您 四 屈 棍 安 郁 鸣 桑 破 怎 篇 蒜 丢 如 洼 瘤 耍 命 戚 浦 侯 两 郭 雷 弯 测 虫 锦 恰 拟 拔 语 缎 您 翁 立 洒 选 趋 脸 歪 堂 擦 台 酸 寝 下 擎  窘 嘴 制 买 贤 贤 舞   昂 偏 投 午 喉 翁 朽 翻 爬 砍 浪 芯 柄 穷 耍 回 趁 丝 状 绝 笨 毛 爸 期 谬 粉 俗 标 茶 胸 彼 剩 展 霸 栓 曼 尤 沁 摘 吹 辨 品 泪 凝 炼 云 憋 程 掐 晾"

#define kSingleWordString2011  @"昂 偏 投 午 喉 翁 朽 翻 爬 砍 浪 芯 柄 穷 耍 回 趁 丝 状 绝 笨 毛 爸 期 谬 粉 俗 标 茶 胸 彼 剩 展 霸 栓 曼 尤 沁 摘 吹 辨 品 泪 凝 炼 云 憋 程 掐 晾 膘 饿 勺 爹 巧 央 羹 赚 痒 绕 滨 甩 滑 拐 军 刘 梦 雄 湿 邓 播 频 姓 蹄 篾 匹 窜 伟 蜂 软 层 踹 居 碗 鸭 谜 窟 至 刷 尘 吃 桶 瞄 犊 嫩 扯 渠 黑 噙 消 船 并 旅 晾 偶 意 憋 眼 雄 腻 床 就 堂 震 风 鸟 唱 荣 订 尺 春 缓 梦 狂 跟 索 扔 巡 塔 辉 蠢 而 巾 灌 砖 柄 控 选 述 缓 典 跳 摸 桨 圆 凤 霜 吼 隶 准 钓 野 亭 嘴 贴 盆 甲 笨 戳 嗅 懂 沟 房 夏 甩 运 贴 瑞 雪 儿 耳 固 此 奉 押 祝 德 自 稿 扩 二 唬 袋 虚 壤 牙 耿 砸 乖 抬 罚 掏 访 药 遣 囊 洽 盘 踢 夺 反 团 闭 广 骂 戳 快 鳃 凝 内 份 锡  肉 许  哀 瘠  带 能  谎  插 歌 瓦 国 制 巾 灌 堆 染 月 竖 卦 决 贩 水 褐 往 氨 磁 尺 雄 滚 摸 授 捣 送 暖 疼 尊 梅 窘 国 耳 纵 厢 偶 摸 粉 硅 杭 塔 海 批 伞 淮 揪 月 抓 直 增 挪 黑 次 抵 凑 摔 隐 辣 听 纵 均 慌 拄 外 追 严 米 奏 许 欠 爬 魂 灯 宅 孔 穷 耍 回 趁 丝 状 减 自 雷 醉 加 玩 热 写 略 迟 井 庙 则 涩 裁 统 债 敢 澳 陡 绝 催 耍 奏 涛 常 剖 内 丙 谬 绝 北 顾 枕 陋 筛 裂 朽 融 耍  损 辈 枫 拐 鞭 瞧 婶 牛 张 很 它 惨 嫩 腿 擦 怎 莫 舔 揍 买 陶 缺 壤 戳 穷 亏 劝 编 愣 居 廷 接 踹 凭 辨 局 知 码 租 勤 晚 军 而 综 矩 星 呕 锐 蛇 想 王 字 云 裤 婚 团 稳 圣 草 憋"


#define kSingleWordString2010  @"碑 涌 破 谋 尝 增 张 槛 枕 涛 吼 高 旺 怎 纫 逮 扇 雁    邹 潮 黑 盖 发 克 拆 撤 施 日 委 腮 舍 擦 惹 俗 讲 乳    恋 偏 音 俏 牛 妙 叠 瞟 铁 聊 掐 丢 笔 家 烟 妾 腻 闷    帆 习 爷 体 盼 冰 退 不 宁 夸 揣 润 锁 御 困 女 农 论    您 端 菌 穷 选 快 化 匀 愿 缺 举 雪 摔 脑 庄 从 光 红    童 孙 窜 谁 飞 最 星 良 施 争 封 挠 趁 而 尺 孙 贼 垮 纳 方 亩 面 屯 开 软 停 嗑 猛    求 涨 随 粟 装 蛆 蔓 舔 掐 债 供 替 颇 挂 熊 君 燃 艘    扫 旬 惹 涛 港 贫 卷 瞥 略 塔 薛 甩 锯 腮 颊 量 婿 晌    月 剜 涩 癣 渗 撒 混 了 拔 判 钉 女 栋 行 削 脆 伪 熟    丢 扁 酿 凹 凑 勺 谢 别 耗 达 嘿 峡 草 黏 湿 引 蚌 你    扶 鹤 狂 揣 习 犬 纫 穷 钻 咱 茶 惹 窒 拜 肋 否 略 返 群 焚 绑 蒸 屉 颊 灭 镖 丢 电    濒 酿 铃 毒 瓜 拔 拽 刽 短 穗 尊 幢 弓 女 穷 虐 捐 雌    俊 凶 窘 沙 择 日 牌 黑 苟 涵 根 旁 乘 忆 掐 掖 瞟 有    甜 贫 良 颈 凸 垮 叵 踹 傀 湍 闻 疮 红 旅 权 啊 恻 买    嘈 抠 栈 啃 仿 圣 辖 苗 演 泯 湘 澡 努 划 锁 暖 双 松    余 悬 紫 傲 悔 二 训 粤 饶 青 胞 浊 沓 揣 蚌 逮 鹤 槛 碑 邹 铐 纽 偶 勺 潘 俏 纫 涩    晌 拈 克 虐 瞟 秦 润 挠 嘭 旅 捐 旋 优 捅 钠 权 训 忆    翁 致 尼 沉 双 广 抡 命 豁 聂 兄 子 乘 脆 目 拨 群 艘    罪 买 红 防 须 亮 决 颇 穷 挖 地 俩 铁 岸 临 丢 馆 扔    灭 军 略 女 扶 团 将 刷 病 洒 未 天 二 层 吃 取 专 迎    划 加 肥 引 却 无 句 给 辞 外 播 们 挑 量 合 秦 宣 揣 软 涩 面 憋 黑 砣 司 乱 蛆 凶    床 润 损 裆 扁 肥 褪 高 很 权 褶 扒 泼 否 蝻 耕 慌 群    痣 笙 宰 宋 鲵 纺 广 排 枕 贰 钻 救 穷 榻 嘭 纽 邹 铐"


#define kSingleWordString2009  @"全 运 踩 块 谎 般 排 泵 北 墙 熔 擦 柔 窝 兰 错 龙 越 陷 稳 肉 许 哀 瘠 带 能 谎 插 蠢 而 伞 刮 藻 笨 衡 末 团 腹 牢 洼 涩 群 谷 团 惨 年 歪 岭 息 吾 僧 原 夫 选 催 穷 端 垮 则 掩 杀 墙  仄 匾  庵 疲  咬 若  唇  内 晒 表 僧 料 双 愁 柬 川 劝 仰 梢 躺 捐 软 黑 啃 罚 骂 菠 怎 沈 袍 彻 恩 秒 瞒 嫩 朽 碑 钱 刷 准 薛 杠 公 讨 槽 运 篇 滑 松 导 廓 骚 昂 偏 投 午 喉 翁 耸 吃 挡 穷 癖 碟 瘟 佟 嫩 棵 搜 恒 免 四 攀 找 刊 料 纯 泛 穗 祖 肥 饼 蹬 贡 跌 敛 根 兑 损 辈 枫 拐 鞭 瞧 婶 牛 张 很 它 惨 嫩 腿 擦 怎 莫 舔 揍 买 陶 缺 壤 戳 穷 亏 劝 编 愣 居 廷 接 踹 凭 辨 局 知 码 租 勤 晚 军 而 综 矩 星 呕 锐 蛇 想 王 字 云 裤 婚 团 稳 圣 草 憋 瓮 撅 渡 窘 巢 季 赢 戳 荣 舱 乌 迟 恩 逛 由 歉 来 者 蒸 遍 醒 层 托 宅 丢 源 抛 策 出 穆 修 娘 染 砌 池 末 屯 傲 塔 家 修 驼 坑 脑 牧 蕊 坤 耳 院 嗓 朽 翻 爬 砍 滨 甩 滑 拐 军 刘 押 我 凑 准 盲 榨 窘 善 白 苦 乙 荤  权 爆  寻 袄  册 疮  却  您 元 精 团 选 寸 赏 财 嗓 劣 颇 则 它 惨 嫩 肿 押 词 播 腿 擦 泽 展 回 又 谎 外 丝 句 槐 耐 责 纺 云 缕 偏 夏 此 军 愿 咧 怎 莫 舔 揍 篾 圆 眯 蜡 份 锡 摘 祥 鳖 穷 字 德 务 准 逆 塘 哲 却 窘 浑 均 狠 酥 北 宗 仍 征 想 痕 剖 诚 饼 锥 死 究 浴 纸 颇 权 括 文 术 柔 赴 拐 祥 志 康 具 迭 窘 下 膜 烂 挥 北 抓 倪 讨 穷 掸 勺 添 谨 赋 农 砖 柄 控 选 述 缓 庞 腔 吮 儒 自 庄 律 颇 吏 肿 押 词 播 矛"


#define kAllWordData @{@2013:kSingleWordString2013,@2012:kSingleWordString2012,@2011:kSingleWordString2011,@2010:kSingleWordString2010,@2009:kSingleWordString2009}



/*
 expression
 
 */

#define kExpressionString2013 @"选举 鹌鹑 用力 军事 豆芽儿 赌博 运输 原则 恳请 全面 草包 约会 女子 旅馆 死扣儿 光明 海洋 痛快 遵守 暖气 推动 挂号 抓紧 恐怖 牛奶 支持 描写 灯笼 穷人 群岛 略微 削弱 荒唐 装配 旦角儿 损坏 着想 柠檬 硫酸 藕节儿 夹杂 篡改 怪癖 耍滑 飘洒 帮厨 搀扶 非分 惨然 恶心 倒退 恶心 防御 骨肉 混乱 闺女 被子 表扬 病菌 彩色 公斤 用处 粮食 排球 区别 学院 盼望 英雄 好玩儿 捐赠 巡逻 决定 衰弱 瓦解 漂流 奶水 假托 深浅 差点儿 铁证 磨难 卡钳 拷打 夸赞 虾酱 唇裂 揣测 美感 透支 一圈儿 粉笔 而后 容易 作者 嗓音 短促 波动 操场 纳闷儿 散光 群岛 爽快 平庸 冰棍 捐款 原来 确凿 本领 迥然 松树 虚心 纳闷儿 强烈 懂得 话剧 尊贵 热爱 情况 美满 外边 追踪 调皮 摆脱 混战 大伙儿 挂号 江南 下巴 显著 有关 佛教 采摘 说头儿 灭迹 仿古 存疑 侵略 工程 吆喝  恰似 所谓 内部 后天 日常 风力 迫切 免费 错误 羞耻 韵律 拥抱 训斥 穷苦 军事 捐税 宏伟 需要 虐待 创新 公费 掠取 软弱 光明  囤积 快餐 准备 窜逃 权益 坏处 凉棚 破裂 有点儿 座谈 仰角 画家 袜子  抵挡 评审 恋爱 留念 而且 僧俗 民航 下课 病号儿 眼色 感想 振奋 口语  老伴儿 手段 刺杀 这会儿 玻璃 挂彩 赞美 答应 法规 埋伏"


#define kExpressionString2012 @"巡逻 凉粉 旅途 挂号 存在 捐款 僧侣 老头儿 日常 罪责 晒台 衰弱 快乐 学会 补贴 散漫 参加 面条儿 温柔 喧闹 牛皮 窘况 雄伟 军队 群众 穷人 省长 女性 刀把儿 别的 压迫 民兵 马虎 权贵 觉悟 确定 困难 飞驰 票子 拼命 偏差 选举 药方儿 壮观 丢失 仇恨 理睬 揣测 童话 酿造 粮食 领导 出息 早点 病因   怪癖 暖和 日常 商榷 开玩笑   讨教 佛经 企图 深厚 云彩   谬论 训词 穷困 南方 分配   组成 牙齿 绿肥 梅雨 质量   白干儿 农村 矿藏 转化 调查 缓解 抢险 本科 秀气 脑力 管家 俯首 硫磺 塞子 包干儿   染料 寻找 最初 活泼 寺庙 从来 确定 日趋 帐篷 小说儿   全局 模仿 停止 岁月 外商 否则 抓紧 磁铁 云彩 差点儿   女工 退化 夏季 况且 增添 牛顿 尊敬 水塔 看穿 大婶儿   重合 哲学 改良 正式 人民币 国务院 背道而驰 灯泡儿 春风 草本 漂亮 姐姐 翅膀 国庆 庙会 来年 归宿 笑话儿   空投 穷困 靶场 常识 平民 内外 炮弹 习性 萌发 小说儿   行业 花生 救济 尽快 享有 材料 存在 腐朽 论文 差点儿   穷尽 乐曲 蕴藏 染色 暖和 波动 重新 感官 女皇 刀把儿   耳朵 开发 默默 虽说 分水岭 轻工业 不计其数 一会儿"


#define kExpressionString2011 @"库存 打算 首先 规律 偶尔 空想 底座 单调 精简 暑期 军阀 逛荡 正中 下水（下水船） 篮球 事物 成套 一股脑儿 努力 豆芽儿 我们 推进 干活儿 偏偏 平川 产量 占有 甲鱼 枪子儿 保温 通知 必然 长者 逢迎 吩咐 校徽 人儿 皮匠 堵塞 原来 难得 飘扬 举行 目前 口号 牺牲 准备 牛排 沿海 危机 库存 打算 首先 规律 偶尔 空想 底座 单调 精简 暑期 军阀 逛荡 正中 下水（下水船） 篮球 事物 成套 一股脑儿 努力 豆芽儿 我们 推进 干活儿 偏偏 平川 产量 占有 甲鱼 枪子儿 保温 通知 必然 长者 逢迎 吩咐 校徽 人儿 皮匠 堵塞 原来 难得 飘扬 举行 目前 口号 牺牲 准备 牛排 沿海 危机  "


#define kExpressionString2010 @"抓紧 率领 荒唐 宣传 贵宾 凯歌 内幕 沙漠 灭亡    草地 名家 漂亮 庄严 脆弱 帮助 画画儿 宗教 穷苦    快乐 歉疚 文雅 掠取 决心 迅速 迥然 时候 下海    女性 烦闷 打盹儿 蛙泳 摄影 恩典 锻炼 只有 跑车    恳请 棍子 暖和 一会儿 飞翔 发送 碰杯 闰年 全体    别扭 存在 铁窗 搜查 老伴儿 别扭 对比 脸色 横行 洗澡 什么 从事 宾馆 顿时    履历 滑冰 许多 税收 森林 脸盘儿 倘若 歌剧 价格 熊猫 日语 素质 漂亮 铜子 管理 卷烟 札记 若干    仰角 谋求 内疚 广度 球场 准备 遭遇 我们 名额    年轻 客气 确实 场所 阻碍 缝子 疟疾 快板儿 群众    船舷 仓库 刀把儿 来自 哀悼 迥然 恢复 纽扣儿 柔软 漂亮 琼脂 快乐 差点儿 协商    捏造 裙子 率领 撒谎 难为 腰鼓 勋章 挂号 粗糙    僵持 牙膏 捐赠 夸大 必须 掐算 梅花 选择 努力    具体 才思 废除 东边 挺拔 侵略 顺手 主角儿 垄断    品种 门牌儿 隐约 舞蹈 团粉 敏感 柴火 昆虫 俗语    规模 成绩 疯狂 丢失 博学 热爱 群众 宣传 暖和 场所 空儿 扑灭 佩服 抢修    藏掖 榜样 聊天儿 认真 光辉 齿轮 学问 聘用 耳朵    瓜分 怪异 讨伐 责令 军队 许可 穷困 撒腿 耍弄    悲愁 此外 默定 小孩儿 狮子 假定 渔民 彩霞 鹁鸪    爽快 全体 展览 酿造 迥然 搜身 觉得 好玩儿 偏差    起码 绷带 举行 流寇 整风 运动  拼命  塑料  早婚    创作  麻雀  快乐    取暖  泡沫 袜子  挂号  "


#define kExpressionString2009 @"仁慈  也许    摧毁  寻求  取缔    探望  衰弱 不用  索性  场合  优胜    皱纹  源泉  够劲儿  昆虫  平整 组阁  热烈  翅膀  小孩儿  胸膛  手语  劳驾    山羊  下巴 蝉联  农民  转载  玩意儿  裁决  极点  特务    能干  死板 儿童  食指  没空  咖啡    佛门  安静   选手   迅速   爱人   跟随  熬夜  谅解   温暖  打听 一会儿 包袱   所有   村镇   和约  发抖  号码  绸子  伤痕 离开   金鱼儿卡车   地球   舞蹈  翻腾  军装  干燥  勇猛 内心   全程   个头儿使唤   宾客  年轻  籍贯  数落  面积 考虑   外乡   仓促   摆摊儿尊崇  盼望  描写  被迫  弱小 英雄   虐待   压强   率领   儿童 军队    赛跑  穷苦  运用  怪罪   捐款   全体  坏死   掠夺 光棍儿  觉得  需要  刮脸  没空儿往往   摈bìn斥  凉快   强调 一瞥   扭转   酒精  表演  棉花   围脖儿 凑合  柔嫩   母亲 脑袋   沙发   战场  瑕疵  真正   传播   驾驭  鸭梨儿匪徒 安置   石油  人生  诅咒   尊重   从容  儿孙   存放   扫除 墨水儿 旅行  羞怯  可怕   恩怨   人体 选种 警犬 扭转 广场 雪茄 两边 主观 损伤 水泥 差点儿   永恒 女儿 散文 窘迫 猛烈 倘若 采购 裙子 便宜 模特儿   祖宗 他们 曲解 臼齿 逊色 缺口 畜牧 辽阔 浑身 包干儿   挖苦 疯狂 飞翔 被告 下层 话筒 四肢 男人 平分 大伙儿   返回 衰老 缩短 热带 虽说 磁场 敏感 破裂 千方百计"

#define kAllExpressionData @{@2013:kExpressionString2013,@2012:kExpressionString2012,@2011:kExpressionString2011,@2010:kExpressionString2010,@2009:kExpressionString2009}
